print('Основная строка базового проекта')

pos = 0
neg = 0
for i in range (6):
    a=int(input(f'Введите число номер {i+1}: '))
    if a > 0:
        pos = pos + 1
    else:
        neg = neg + 1
if pos > neg:
    print('.................................................................')
    print(f'Положительных чисел больше чем отрицательных: {pos} против {neg}')
elif neg > pos:
    print('.................................................................')
    print(f'Отрицательных чисел больше чем положительных: {pos} против {neg}')
else:
    print('.........................................................................')
    print(f'Количество положительных и отрицательных чисел равно: {pos} против {neg}')